Repository: boid42/youtube_timecodes_by_text
Catalog: locale/*/LC_MESSAGES/youtube_timecodes_by_text.po
Languages: ru

source: A query for search. See --search_engine parameter.
ru: Поисковый запрос. Смотрите описание аргумента --search_engine

source: default: simple case-insensitive string comparison regex: Python's standard regular expression. See https://docs.python.org/3/library/re.html#regular-expression-syntax whoosh: Whoosh search engine. See https://whoosh.readthedocs.io/en/latest/querylang.html
ru: Метод поиска: default: простое сравнение строк без учета регистра regex: стандартное регулярное выражение языка Питон. Справка: https://docs.python.org/3/library/re.html#regular-expression-syntax whoosh: поисковый движок Whoosh. Справка: https://whoosh.readthedocs.io/en/latest/querylang.html

source: Path to directory where pre-downloaded youtube video subtitles are located. Used only --youtube_channel_url option is not specified. VTT subtitles format is supported only. Json file with video information should be located in the same folder.
ru: Путь к директории, где расположены заранее скачанные youtube видео субтитры. Используется только, когда не указан аргумент --youtube_channel_url. Единственный поддерживаемый формат субтитров - VTT. Файл json с информацией о видео должен быть расположен рядом с файлом субтитров.

source: Download missing subtitles for channel before searching. Warning: Slows down execution especially if Youtube throttles on too often requests. Best practice is to download missing subtitles only when necessary. Searching can rely on caches subtitles. Just remove this option after downloading or use argument --subtitles_downloading_cooldown_hours.
ru: Скачать недостающие субтитры всех видео youtube канала перед поиском. Внимание: замедляет выполнение запроса, особенно в случае, когда Youtube активирует троттлинг при частых запросах. Скачивание рекомендуется выполнять только при необходимости. Рекомендуется выполнять поиск в закэшированных субтитрах. Просто удалите этот аргумент после скачивания или воспользуйтесь аргументом --subtitles_downloading_cooldown_hours, чтобы выполнять обращение к youtube реже.

source: Subtitles language code. Format: ISO 639. Examples: en, ru. Default is 'ru'.
ru: Язык скачиваемых субтитров в формате ISO 639. Примеры: ru, en. По-умолчанию: ru.

source: Delete downloaded video info files(subtitles and json) after conversion to text form to save file system space.
ru: Удалить скачанные файлы, связанные с видео(субтитры и json файл информации о видео), после преобразования субтитров в текстовую форму, чтобы сохранить свободное место файловой системы.

source: URL of Youtube channel to download subtitles from. Ex: https://www.youtube.com/@galkovskyland
ru: Ссылка на Youtube канал, откуда будут скачаны субтитры. Пример: https://www.youtube.com/@galkovskyland

source: Path to root subtitles cache directory. All downloaded subtitles will be stored there.
ru: Путь к директории кэша субтитров. Все скачанные субтитры будут сохранены здесь.

source: When downloading subtitles use video identifier instead of video title as part of names of created files and folders. Allows to avoid problem of max path length on Windows OS.
ru: При скачивании субтитров использовать идентификатор вместо названия видео как часть имени создаваемых файлов и директорий. Позволяет обойти проблему ограничения длины пути файловой системы по-умолчанию в операционной системе Windows

source: Output format
ru: Формат результата поиска

source: Total number of lines preceding and following the line that matches query
ru: Количество строк текста субтитров до и после строки, удовлетворяющей запросу

source: Path to output file. If not specified, standard output stream is used
ru: Путь для сохранения файла с результатом поиска. Если аргумент не указан, результат направляется в стандартный вывод

source: Path to yt-dlp tool that is used for subtitles downloading. Tool can be downloaded from https://github.com/yt-dlp/yt-dlp/releases page. If argument is not specified rely on PATH environment variable.
ru: Путь к утилите yt-dlp, которая используется для скачивания субтитров. Скачать/обновить ее можно по адресу https://github.com/yt-dlp/yt-dlp/releases Если аргумент не указан, используется переменная среды PATH

source: Prevents network access to Youtube for specified number of hours after last successful downloading attempt when downloading is requested. Purpose is to allow non-experienced users to use unified program arguments and have both up to date subtitles and search attempt immediate responses
ru: Предотвращает обращение к youtube в течение указанного количества часов после последнего успешного скачивания субтитров. Позволяет неопытным пользователям пользоваться унифицированным набором аргументов, чтобы всегда искать по самым свежим субтитрам без задержек, связанных с сетевыми запросами

source: Whoosh search customization
ru: Настройка поиска с помощью Whoosh

source: Sorting method.
ru: Метод сортировки.

source: Limits number of search results in each video subtitles
ru: Ограничивает количество результатов в каждом файле субтитров

source: Regex search customization
ru: Настройка поиска с помощью регулярного выражения

source: Default search approach is to search line by line. This option allows to find text split between two adjacent lines
ru: По-умолчанию, поиск происходит в каждой строке. Данный аргумент позволяет искать на границе соседних строк

source: Option --youtube_channel_url should be specified when downloading is requested.
ru: Аргумент --youtube_channel_url должен быть указан, так как запрошено скачивание субтитров.

source: Option --searching_directory should not be specified when subtitles downloading is requested. Argument --subtitles_cache_directory allows to change location of downloaded subtitles
ru: Аргумент --searching_directory не должен быть указан, так как запрошено скачивание субтитров. Вместо этого можно изменить директорию для скачанных субтитров с помощью аргумента --subtitles_cache_directory

source: Option --searching_directory should not be specified when youtube channel is specified. Argument --subtitles_cache_directory allows to change location of downloaded subtitles
ru: Аргумент --searching_directory не должен быть указан, так как указана ссылка на youtube канал. Вместо этого можно изменить директорию для скачанных субтитров с помощью аргумента --subtitles_cache_directory

source: One of following options should be specified: --searching_directory, --download_subtitles, --youtube_channel_url
ru: Необходимо указать как минимум один из следующих аргументов: --searching_directory, --download_subtitles, --youtube_channel_url

source: Do not double-click the executable, instead call it from a command line.
ru: Не запускайте программу двойным кликом мыши. Требуется запуск из командной строки.
